// *++
//
// Copyright (c) 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution.  The full text of the license may be found at        
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   VfrStrings.vfr
// 
// Abstract:
// 
//   String definitions for Set Options formset.
// 
// 
// --*/


/=#

#langdef en-US "English"
#langdef fr-FR "Francais"


#string STR_EMPTY_STRING                          #language en-US  ""

#string STR_TITLE                                 #language en-US  "Set Options"
                                                  #language fr-FR  "French: Set Options"
#string STR_TITLE_HELP                            #language en-US  "Use driver's own configuration capbility to configure device"
                                                  #language fr-FR  "French: Use driver's own configuration capbility to configure device"
#string STR_FIRST_REFRESH                         #language en-US  "Please refresh page firstly"
                                                  #language fr-FR  "French: Please Refresh page firstly"
#string STR_FIRST_REFRESH_HELP                    #language en-US  "When enter the page at first time, refresh is needed to show all the drivers which support to set options"
                                                  #language fr-FR  "French: When enter the page at first time, Refresh is needed to show all the drivers which support to set options"
#string STR_GOTO_HELP_DRIVER                      #language en-US  "To config all the devices that are managed by the driver"
                                                  #language fr-FR  "French: To config all devices that are managed by the driver"
#string STR_GOTO_HELP_DEVICE                      #language en-US  "To config the specific device managed by a driver"
                                                  #language fr-FR  "French: To config the specific device managed by a driver"
#string STR_GOTO_HELP_CHILD_DEVICE                #language en-US  "To config the specific child of a device managed by a driver"
                                                  #language fr-FR  "French: To config the specific child of a device managed by a driver"
#string STR_REFRESH                               #language en-US  "Refresh"
                                                  #language fr-FR  "French: Refresh"
#string STR_REFRESH_HELP                          #language en-US  "Refresh to show the current  drivers which support to set options"
                                                  #language fr-FR  "French: Refresh to show the current  drivers which support to set options"
#string STR_DRIVER_DEFAULT_NAME                   #language en-US  "Driver Default Name"
                                                  #language fr-FR  "French: Driver Default Name"
#string STR_DRIVER_CONTROLLER_DEFAULT_NAME        #language en-US  "Device Controller Default Name"
                                                  #language fr-FR  "French: Device Controller Default Name"
#string STR_DRIVER_CHILD_CONTROLLER_DEFAULT_NAME  #language en-US  "Child Device Controller Default Name "
                                                  #language fr-FR  "French: Child Device Controller Default Name "
#string STR_ACTION_REQUIRED_ACTION_NOW            #language en-US  "Action now? Enter (YES) / Esc (NO)"
                                                  #language fr-FR  "French: Action now? Enter (YES) / Esc (NO)"
#string STR_ACTION_REQUIRED_CONTINUE              #language en-US  "Enter to continue"
                                                  #language fr-FR  "French: Enter to continue"
#string STR_ACTION_REQUIRED_NONE                  #language en-US  "The action required is 'None'"
                                                  #language fr-FR  "French: The action required is 'None'"
#string STR_ACTION_REQUIRED_STOP_CONTROLLER       #language en-US  "The action required is 'Stop Controller'"
                                                  #language fr-FR  "French: The action required is 'Stop Controller'"
#string STR_ACTION_REQUIRED_RESTART_CONTROLLER    #language en-US  "The action required is 'Restart Controller'"
                                                  #language fr-FR  "French: The action required is 'Restart Controller'"
#string STR_ACTION_REQUIRED_RESTART_PLATFORM      #language en-US  "The action required is 'Restart Platform'"
                                                  #language fr-FR  "French: The action required is 'Restart Platform'"
#string STR_ACTION_REQUIRED_STOP_SELECT_ERROR     #language en-US  "Please select specific controller item to do the stop"
                                                  #language fr-FR  "French: Please select specific controller item to do the stop"
#string STR_ACTION_REQUIRED_DISCON_CONTRO_ERROR   #language en-US  "Can not disconnect the controller !"
                                                  #language fr-FR  "French: Can not disconnect the controller !"
#string STR_ACTION_REQUIRED_START_SELECT_ERROR    #language en-US  "Please select specific controller item to do the start!"
                                                  #language fr-FR  "French: Please select specific controller item to do the start!"
#string STR_ACTION_REQUIRED_DISCON_CHILCON_ERROR  #language en-US  "Can not disconnect the child controller !"
                                                  #language fr-FR  "French: Can not disconnect the child controller !"
#string STR_ACTION_REQUIRED_CONNECT_CONTRO_ERROR  #language en-US  "Can not connect the controller !"
                                                  #language fr-FR  "French: Can not connect the controller !"
#string STR_NULL_STRING                           #language en-US  ""
                                                  #language fr-FR  ""

